user_tutorial/thermFluidOptFoam/thermFluid_fullyDevFlow/constant/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalProperties;
}

k_fluid        k_fluid [1  1 -3 -1 0 0 0] 0.1056;           // Fluid thermal conductivity
rho_fluid    rho_fluid [1 -3  0  0 0 0 0] 865.0;    		// Fluid density
cp_fluid      cp_fluid [0  2 -2 -1 0 0 0] 1670.0;    		// Fluid specific heat capacity

k_solid        k_solid [1  1 -3 -1 0 0 0] 238.0;            // Solid thermal conductivity
rho_solid    rho_solid [1 -3  0  0 0 0 0] 890.0;    		// Solid density
cp_solid      cp_solid [0  2 -2 -1 0 0 0] 1670.0;    		// Solid specific heat capacity

q_gen            q_gen [0  0 -1  1 0 0 0] -70.0;            // Specific heat generation Q/(rho*cp)
T_min            T_min [0  0  0  1 0 0 0] 293.15;           // Minimum temperature of domain
